package Day07.Ex1; // 현재 클래스가 위치한 패키지명 

public class Student {// 클래스[클래스는 첫글자 대문자] // 클래스 시작 
	
	// 필드[저장소] , 생성자[객체초기화] , 메소드[동작] 구성
	// - 생성자 생략시 기본생성자 자동 생성 Student( )
	
} // 클래스 끝
/*
  	객체(object) : 식별 가능한 형태[ 상태=필드 , 행동=메소드/함수 ]
  	객체지향프로그래밍[ OOP ] : 부품[객체] 먼저 만들고 부품[객체]들을 조립해서 하나의 제품[프로그램] 생성
 	
 	클래스 : 설계도( 객체의 설계도 )
 		인스턴스화( new ) 
	인스턴스 : 
	객체 : 
	
	변수 , 인스턴스 , 객체 
	
	JVM 관점
					 인스턴스화(new)
		  스택영역 		=	힙영역
		  변수				인스턴스
객체		클래스명 변수명		=	new 생성자();		
객체		String str 		=	new String("유재석")
					<--주소---
객체		String str2 	= 	null




	
 */
